#### Terraform Plan
```
scaleway_registry_namespace.main: Refreshing state... [id=fr-par/4d432867-6d38-46ed-958d-5c2af7140d5d]
scaleway_container_namespace.main: Refreshing state... [id=fr-par/69224327-f627-44c6-9b3f-d9fc33faab42]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # scaleway_container_namespace.main has been deleted
  - resource "scaleway_container_namespace" "main" {
      - id                       = "fr-par/69224327-f627-44c6-9b3f-d9fc33faab42" -> null
        name                     = "testinfrarepo"
        # (8 unchanged attributes hidden)
    }

  # scaleway_registry_namespace.main has been deleted
  - resource "scaleway_registry_namespace" "main" {
      - endpoint        = "rg.fr-par.scw.cloud/testinfrarepo" -> null
        id              = "fr-par/4d432867-6d38-46ed-958d-5c2af7140d5d"
        name            = "testinfrarepo"
        # (5 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # scaleway_container.service["app"] will be created
  + resource "scaleway_container" "service" {
      + cpu_limit             = 500
      + cron_status           = (known after apply)
      + deploy                = true
      + domain_name           = (known after apply)
      + environment_variables = (known after apply)
      + error_message         = (known after apply)
      + http_option           = "redirected"
      + id                    = (known after apply)
      + local_storage_limit   = (known after apply)
      + max_concurrency       = (known after apply)
      + max_scale             = 10
      + memory_limit          = 512
      + min_scale             = 0
      + name                  = "testinfrarepo-app"
      + namespace_id          = (known after apply)
      + port                  = 8080
      + privacy               = "public"
      + protocol              = "http1"
      + registry_image        = (known after apply)
      + sandbox               = (known after apply)
      + status                = (known after apply)
      + timeout               = 300

      + health_check (known after apply)

      + scaling_option {
          + concurrent_requests_threshold = 50
        }
    }

  # scaleway_container_namespace.main will be created
  + resource "scaleway_container_namespace" "main" {
      + activate_vpc_integration = true
      + description              = "Serverless container namespace for testinfrarepo"
      + destroy_registry         = false
      + id                       = (known after apply)
      + name                     = "testinfrarepo"
      + organization_id          = (known after apply)
      + project_id               = (known after apply)
      + registry_endpoint        = (known after apply)
      + registry_namespace_id    = (known after apply)
    }

  # scaleway_registry_namespace.main will be created
  + resource "scaleway_registry_namespace" "main" {
      + description     = "Container registry for testinfrarepo"
      + endpoint        = (known after apply)
      + id              = (known after apply)
      + is_public       = false
      + name            = "testinfrarepo"
      + organization_id = (known after apply)
      + project_id      = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + container_ids     = {
      + app = (known after apply)
    }
  + container_urls    = {
      + app = (known after apply)
    }
  ~ registry_endpoint = "rg.fr-par.scw.cloud/testinfrarepo" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
```
*Triggered by @skepptestah[bot]*